package net.ittimeline.java.core.foundational.operator.bit;

/**
 * 无符号右移运算符操作正整数之8 >>> 4
 *
 * @author tony 18601767221@163.com
 * @version 2024/10/16 20:56
 * @since Java21
 */
public class UnsignedRightShiftPositiveNumber3 {
    public static void main(String[] args) {
        /*
            1.先计算8的补码（计算机中的数据是使用补码进行运算的，正数的原码、反码、补码都一样）
                8的补码：0000 0000 0000 0000 0000 0000 0000 1000

            2.计算8 >>> 4（ 右移运算符的运算规则是用于将数据的二进制位向右移动，左边填充0）
                0000 0000 0000 0000 0000 0000 0000 1000
                >>> 4
                =
                0000 0000 0000 0000 0000 0000 0000 0000

            3.将补码换算成原码（查看运算结果看原码）
                正数的原码、反码、补码都一样
                补码：0000 0000 0000 0000 0000 0000 0000 0000
                原码：0000 0000 0000 0000 0000 0000 0000 0000

            4.将原码转换为十进制（打印输出结果是十进制）
                0000 0000 0000 0000 0000 0000 0000 0000转换为十进制结果是0
            5.程序运行结果
                8 >>> 4 结果就是 0
         */
        System.out.println("8 >>> 4 = " + (8 >>> 4));
    }
}
