package net.ittimeline.java.core.foundational.control.loop.nestedloop;

/**
 * 嵌套循环核心概念
 * ● 嵌套循环是指将一个循环（内层循环）放在另一个循环（外层循环）的循环体中。这三种循环既可以作为外层循环，也可以作为内层循环，相互组合使用。
 * ● 执行流程：外层循环每迭代一次，内层循环都会从头至尾完整执行，直到其循环条件为false，然后才进入外层循环的下一次迭代
 * ● 形象比喻：外层循环好比时钟的时针，内层循环好比分针。时针每走一格（外层循环执行一次），分针就要转满一圈（内层循环完整执行一轮）
 * ● 执行次数：若外层循环执行 m 次，内层循环执行 n 次，则内层循环的循环体总共执行 m × n 次。
 * ● 应用场景：打印复杂图形（矩形、三角形、菱形）、多维数组遍历、多重条件的重复处理
 * ● 二维图形视角：在打印矩阵或表格时，外层循环常控制行数，内层循环控制列数。
 * <p>
 * 嵌套循环实际应用与建议
 * ● 在项目开发中，嵌套循环常用于实现复杂业务逻辑，最常见的组合是for 循环嵌套 for 循环，但也可混合使用 while 或 do-while。
 * ● 可读性建议：嵌套层数一般控制在2 层以内，最多不超过3 层。超过 3 层会严重降低代码可读性，此时应重新审视业务逻辑或算法设计，考虑拆分为方法或采用其他数据结构优化。
 * <p>
 * <p>
 * <p>
 * for循环嵌套for循环（两层嵌套）的语法格式
 * //外层for循环
 * for(①外层初始化;②外层循环条件判断;⑧外层循环迭代){
 * //外层循环循环体语句= 内层循环+其他代码
 * //内层for循环
 * for(③内层初始化;④内层条件判断;⑥内层循环迭代){
 * ⑤内层循环体;
 * }
 * //⑦外层循环体中的“其他代码”
 * }
 * 嵌套循环执行流程
 *
 * @author tony 18601767221@163.com
 * @version 2026/10/7 14:37
 * @since Java 25
 */
public class NestedLoopFlow {
    static void main() {
        //外层循环执行次数
        int outerCount = 0;
        //内层循环执行次数
        int innerCount = 0;

        for (int i = 0; i < 2; i++) { //外层循环执行2次
            System.out.println("i = " + i);
            for (int j = 0; j < 3; j++) {//内层循环2轮，每轮3次  执行6次
                System.out.println("\tj = " + j);
                //内层循环执行次数累加
                innerCount++;
            }
            //外层循环执行次数
            outerCount++;
        }
        System.out.printf("外层循环执行%d次，内层循环执行%d次\n", outerCount, innerCount);
    }
}
