package net.ittimeline.java.core.foundational.syntax.numbersystem;

/**
 * 计算机中二进制的三种表示方式
 * 1. 原码、反码、补码
 * 2. 计算机底层采用二进制的补码形势存储
 * 3. 对于Java来说，虽然底层真实采用二进制补码形势存储，但是打印输出到终端的时候使用的是原码
 * 4. 对于正数的原码，反码、补码是怎么回事？   正数的原码、反码、补码是同一个
 * 5. 对于数字来说有正负之分（对于字符型来说没有正负之分）
 * 在二进制当中最左边的二进制位是一个符号位
 * 1 表示负数
 * 0 表示正数
 * 6. 对于负数的原码、反码、补码是怎么回事？
 * 原码：将绝对值转换为二进制后，最高位改为1
 * 反码：在原码的基础上，符号位不变，其他位取反
 * 补码：在反码的基础上，符号位不变，加1
 * 7. 请计算出byte的取值范围： -128 ~ 127
 * 1Byte = 8bit
 * byte的最大值（正数） 0111 1111 127
 * byte的最小值（负数） 0000 0000  -128
 * <p>
 * 8. 1个字节的-128这个数字对应的原码、反码、补码是什么
 * -128的绝对值是128
 * 128对应的二进制1000 0000
 * -128的原码：1000 0000
 * -128的反码：1111 1111
 * -128的补码：1000 0000
 * <p>
 * 9.怎么验证这个-128是byte中的最小值？
 * 1000 0000 + 1 = 1000 0001
 * 1000 0001 是一个补码
 * 根据补码求原码：补码取反+1
 * 1000 0001（补码） 取反 1111 1110
 * 1111 1110 +1 结果是 1111 1111（原码）
 * 1111 1111 转换为十进制 最左边是1表示负数，111 1111转换为十进制127，最终结果是-127
 * <p>
 * 10. 给了一个补码，你需要将补码转换为原码？ 我们为什么需要这个能力？
 * 底层真实存储是补码，但是最终显示给人类的时候是原码形势，因此需要具备这个推算的能力。
 * <p>
 * 补码怎么转换成原码？补码取反+1
 *
 * @author tony 18601767221@163.com
 * @version 2026/10/3 18:43
 * @since Java 25
 */
public class NumberSystem {
    static void main() {
        short s = 130;
        byte b = (byte) s;
        /*
           short占用两个字节
           两个字节  130 转换为 二进制  0000 0000 1000 0010
           强制转换为byte，byte占用一个字节
           左边高八位被砍掉，结果是1000 0010
           最高位1表示负数
           补码转换为原码
           1000 0010（补码） 取反 1111 1101
           1111 1101 +1 1111 1110（原码）
           1111 1110 转换为十进制
           1111 1110 最左边二进制位是1 表示负数
            111 1110 转换为十进制结果126
           1111 1110 转换为十进制结果就是-126

         */
        System.out.println("b = " + b);
        /*
            程序运行结果：
            b = -126
            -126怎么来的?
         */
    }
}
