package net.ittimeline.java.core.foundational.syntax.variable;

/**
 * 变量的声明、赋值和定义
 * 1. 变量的声明语法：数据类型 变量名;
 * 数据类型目前大家知道三个即可：int 、double 、String
 * 变量名：只要是合法的标识符即可
 * <p>
 * 2. 变量的赋值语法：变量名 = 值;
 * 使用= 赋值运算符进行赋值
 * = 赋值运算符右边的表达式优先级比较高
 * <p>
 * 3. 变量声明和赋值可以一起完成
 *
 * 4.变量的访问：①读取、②修改
 *
 * @author tony 18601767221@163.com
 * @version 2026/10/3 15:31
 * @since Java 25
 */
public class VariableDefinition {
    static void main() {
        /********************************1.变量的声明、赋值********************************/
        //变量的声明语法格式： 数据类型 变量名;
        int age;
        //变量的赋值语法格式： 变量名 = 变量值;
        age = 32;
        /********************************2.变量的定义********************************/
        //变量的定义语法格式： 数据类型 变量名 = 变量值;
        //变量在赋值的时候除了可以赋值数据类型对应的字面量值
        int value = 10;

        //还可以将变量赋值给另外一个变量
        int copyValue = value;

        //变量的访问：①读取、②修改
        //读取变量的值，采用字符串拼接的方式
        System.out.println("age = " + age);

        //修改变量的值
        age = 23 + 1;
        System.out.println("age = " + age);
    }
}
