package net.ittimeline.java.core.foundational.operator.bitwise.unsignedrightshift;

/**
 * 无符号右移运算符操作正整数之8 >>> 1
 *
 * @author tony 18601767221@163.com
 * @version 2026/10/4 15:10
 * @since Java 25
 */
public class UnsignedRightShiftPositiveNumber1 {

    static void main() {
        /*
            1.先计算8的补码（计算机中的数据是使用补码进行运算的，正数的原码、反码、补码都一样）
                8的补码：0000 0000 0000 0000 0000 0000 0000 1000

            2.计算8 >>> 1（无符号右移运算符的运算规则是用于将数据的二进制位向右移动，左边填充0）
                0000 0000 0000 0000 0000 0000 0000 1000
                >>> 1
                =
                00000 0000 0000 0000 0000 0000 0000 100

            3.将补码换算成原码（查看运算结果看原码）
            正数的原码、反码、补码都一样
            补码：00000 0000 0000 0000 0000 0000 0000 100
            原码：00000 0000 0000 0000 0000 0000 0000 100

            4.将原码转换为十进制（ 打印输出结果是十进制）
                00000 0000 0000 0000 0000 0000 0000 100转换为十进制结果是4

            5.程序运行结果
                8 >>> 1 结果就是4
         */
        System.out.println("8 >>> 1 = " + (8 >>> 1));
    }

}
