package net.ittimeline.java.foundational.operator.bit;

/**
 * 按位或的使用
 *
 * @author tony 18601767221@163.com
 * @version 2021/3/15 21:52
 * @since JDK11
 */
public class BitOrOperator {

    public static void main(String[] args) {
        // 按位或(|): |左右两边的二进制补码有一个为1，运算结果为1，否则就是0
        /*
           按位或的计算过程
           128 默认四个字节 128的二进制补码表示方式为 0000 0000 0000 0000 0000 0000 1000 0000
           64  默认四个字节 64的二进制补码表示方式为  0000 0000 0000 0000 0000 0000 0100 0000

           0000 0000 0000 0000 0000 0000 1000 0000  |
           0000 0000 0000 0000 0000 0000 0100 0000  =
           0000 0000 0000 0000 0000 0000 1100 0000  转换成十进制就是192

         */


        //  128 | 64 = 192
        System.out.println("128 | 64 = "+(128 | 64 ));
    }
}
